#ifndef __INCLUDE_GUARD__GetOneTweetJSON
	//既に構造体が定義されている場合は、俗称インクルードガードによって、再定義を回避する。
	#define __INCLUDE_GUARD__GetOneTweetJSON	//[__INCLUDE_GUARD__]を定義し、次回以降読み込まないようにする。


#include "Make_Connection.h"
#include "../MyOAuthFunc/Generate_CustomHeadre_of_Authorization.h"	//Generate_CustomHeadre_of_Authorization()


//=========================================================================================================================================================================================================================
// [ class GetTweet ] :: begin :: TwitterAPIでTwitterサーバーへのアクセスを確立し、ツイート一件分のテキストごとに切り分ける関数。(その後は、Process.cppの関数が、一件分に切り分けられたデータから、数値を読み取っていく。)
//=========================================================================================================================================================================================================================
//=========================================================================================================================================================================================================================

class GetTweet{
	private:
		struct Make_Connection_struct MC;
	public:
		int result;
		
		//コンストラクタやディストラクタは、戻り値が無く、void型ですら無いため、returnが使えない。余りにも使いにくいので、今回は、初期化関数と終了関数を用意する事とした。
		//コンストラクタ
		GetTweet();
		//ディストラクタ
		~GetTweet();
		
		int GetTweet_Initialize( struct OAuth_parameters &OA );				//OAuth認証を通して、通信を開始する。
		int GetTweet_Finalize();													//通信を切断する。(ただし、正常に終了しなかった場合は、関数内部で既に終了処理が記述されているので、呼び出す必要は無い。)
		
		//メンバ関数
		std::string OneTweet;	//GetOneTweet();関数からreturn 0;で制御が戻る場合に、一つ分のツイートが格納されている。
		int GetOneTweet();
};


//=========================================================================================================================================================================================================================
//=========================================================================================================================================================================================================================
// [ class GetTweet ] :: end ::
//=========================================================================================================================================================================================================================


#endif//__INCLUDE_GUARD__GetOneTweetJSON


